<%--
  Created by IntelliJ IDEA.
  User: destiny
  Date: 18/3/2020
  Time: 13:30
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <link rel="shortcut icon" type="image/x-icon" href="/static/img/logo.png"/>
    <link rel="stylesheet" href="/static/css/reset.css" type="text/css"/>
    <link rel="stylesheet" href="/static/css/nav.css" type="text/css"/>
    <link rel="stylesheet" href="/static/css/normal.css" type="text/css"/>
    <link rel="stylesheet" href="/static/css/footer.css" type="text/css"/>
    <link rel="stylesheet" href="/static/css/literature.css" type="text/css"/>
</head>
<body>
<%@include file="/WEB-INF/public/nav.jsp" %>
<header>
    <img id="banner" src="/static/img/banner.png" style="width: 100%; height: 200px">
</header>
<mian>
    <section class="normal-width main-box">
        <div class="literature-box">
            <h1>这是一个标题</h1>
            <hr>
            <div class="context">
                <p>
                    东汉末年，外戚专权，宦官秉政，政治腐败，天灾不断。汉灵帝中平元年（184年），黄巾起义爆发，从此开始了近一百年的战乱时代。
                    黄巾起义被镇压后，外戚、宦官在内斗中失去权柄，永汉元年（189年），董卓控制朝廷 [3] ，初平三年（192年），董卓被吕布所杀，李傕、郭汜控制东汉王朝 [8]
                    。地方州郡长官在反董卓战争及后来的相互攻伐中逐渐壮大实力，形成了地方军阀割据 [9-11] 。
                    曹操凭借“挟天子以令诸侯”的政治优势，经过多年的南征北战，先后消灭吕布、袁术等割据势力，降张绣、逐刘备，控制了兖州、豫州、徐州以及司州等地。在官渡之战中，接受许攸的建议，曹操亲自率兵火烧袁绍的军粮，以少胜多，击败了河北强大的割据势力袁绍。在白狼山之战中，派遣大将张辽率领先锋部队大破乌桓并斩杀乌桓单于蹋顿，随后又平定辽东，最终统一了北方
                    [12] [13-14] 。
                    建安十三年（208年），曹操乘刘表病亡、荆州不稳之时，征荆州，刘琮束手投降，寄身荆州的刘备被迫退守夏口。曹操对江东虎视眈眈。在刘备谋士诸葛亮与孙权谋臣鲁肃的共同推动下，孙刘结盟 [15] [16]
                    [17]
                    [18] 。其后孙刘联军大败曹军于赤壁，曹操被迫退回北方，这就是奠定三国形成局面的赤壁之战。刘备乘势占据荆州五郡 [15]
                    ，后分别于建安十九年（214年）和建安二十四年（219年）夺得益州和汉中，势力达到了极盛。
                    曹操于建安十五年（211年）击破关中马超、韩遂等部 [19] ，又命夏侯渊西征，消灭了韩遂、宋建等割据势力，将凉州纳入“魏”的势力范围之内，此后曹操数次南下，孙权亦曾数次北上，双方均未获得大的进展。
                    建安二十四年（219年），而曹军从汉中退至长安。孙权又攻合肥，曹魏诸州皆抽调兵力赴扬州屯驻。 [20-21] 刘备大将关羽趁虚而入攻打襄樊，趁着“大霖雨，汉水泛溢”（正史中，关羽并未决堤）
                    [22-24]
                    ，乘船进攻，擒于禁，斩庞德， [25] 围曹仁于樊城 [26] ，许昌以南纷纷响应关羽，关羽一度威震华夏 [25]
                    ，但不久，徐晃击退关羽。曹操又采纳司马懿的建议，派人劝说孙权合攻关羽，孙权大将吕蒙设计偷袭荆州，杀关羽，至此荆州大部落入孙权之手 [17] [18] 。
                    延康元年（220年）冬，曹丕篡汉称帝，建都洛阳，国号“魏”，史称“曹魏” [27] 。三国正式开始。黄初二年（221年），刘备为了延续汉朝、兴复汉室，于成都称帝，国号“汉” [15]
                    ，史称“蜀汉或季汉”。刘备为报孙权夺荆州、杀关羽之仇，在称帝后不久，就率数万大军东讨孙权。222年，被陆逊败于夷陵， [28] 蜀汉实力大损，成为三国中最弱小的一国。
                    孙权于222年被魏文帝曹丕封为吴王，229年在武昌（今湖北鄂城）称帝，国号“吴” [17] ，改元黄龙元年，史称“东吴”。后又迁都建业，自此三国正式鼎立。
                    诸葛亮辅佐刘备之子刘禅与东吴孙权重新联盟，并致力恢复国内生产。三国中后期，诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。
                    正始十年（249年），曹魏发生了高平陵之变， [29]
                    司马氏控制了大权。王凌、毌丘俭、诸葛诞等人先后三次讨伐司马氏，均以失败告终。炎兴元年（263年），司马昭派钟会、邓艾、诸葛绪分兵三路南征蜀汉，与蜀汉大将军姜维发生拉锯战，钟会被挡于剑阁，邓艾避开姜维的锋芒，抄阴平小路直取涪城
                    [30] ，进逼成都，刘禅投降，蜀汉灭亡。泰始元年（265年），司马昭之子司马炎迫曹魏皇帝曹奂禅让而称帝 [31]
                    ，建立晋朝，史称西晋，仍定都洛阳。太康元年（280年），晋武帝司马炎大举伐吴，孙皓投降，东吴灭亡，三国时代结束 [32] 。
                    黄巾之乱
                    黄巾起义
                    黄巾起义
                    184年，太平道首领张角及兄弟张梁和张宝率信徒发起民变，史称黄巾之乱，迅速发展到数百万追随者，引起全国性的战乱 [33] 。汉灵帝派皇甫嵩、卢植及朱隽等率中央军压制 [34-35]
                    ，又令地方州郡政府和豪强地主招募军队协助。最后黄巾军的主力虽然很快被击溃，不过余部仍然散布各地。随着各地山贼土匪陆续出现，汉朝的中央军精疲力竭 [36] 。
                    188年汉灵帝采纳刘焉的建议 [37] [38] ，将负责监察各郡的刺史赋予兼有地方军政权力，以加强对各郡的控管，并且将部分刺史升为州牧，由刘姓宗室或重臣担任 [39]
                    。这一措施使得州正式成为一级行政区，虽有利于镇压各地叛乱，但当朝廷发生内乱后，掌握地方权力的州牧及刺史纷纷割据一方，不再受朝廷节制。例如益州牧刘焉割据巴蜀，借由五斗米道首领张鲁占领汉中 [40]
                    ，切断与朝廷的关系。东汉为解决黄巾之乱而制定的州牧制度，在朝廷不断衰弱下，反而开启群雄割据的局面。 [41]
                    188年汉灵帝驾崩，戚宦之争又起。宦官蹇硕等意图杀害外戚大将军何进，改立太子刘辩弟陈留王刘协 [42] 。汉少帝刘辩顺利继立后 [43] ，何进又与袁绍等士大夫企图去除以张让为首的十常侍及其他宦官
                    [42]
                    。何进还令凉州董卓、并州丁原带兵增援。宦官们先发制人，在董卓军到达洛阳前杀死何进。而袁绍则以为何进报仇为名率军入宫，杀死十常侍等宦官二千人 [12]
                    。虽然困扰东汉上百年的外戚与宦官之争就此终结，却也方便了率军入都城的董卓顺势夺取朝政大权。
                    董卓乱政
                    董卓为了夺权，开始铲除反对者，手段残暴，引起了诸多不满。他促使吕布杀死掌管都城禁卫的丁原夺得军队，袁绍及曹操等原先掌握过兵权的将领纷纷逃离首都洛阳 [42]
                    。最后董卓废黜并杀死了汉少帝，改立刘协为帝，史称汉献帝，至此董卓完全掌握了朝廷 [42] 。
                    190年，东郡太守桥瑁诈称以京师三公之名向各地发檄文 [44] ，陈述董卓的恶行，联络各地州牧、刺史及太守讨伐董卓，共有十一路地方军加入，群雄并起，共推袁绍为盟主，史称“关东军” [42]
                    。董卓为了回避其锋芒，于是挟持汉献帝、强迁居民，迁都到长安，并火烧旧都洛阳 [42] 。其间，关东联军只有孙坚 [45] 、曹操真正出兵与董卓对战，但因持久力不足而退，而关东军也随之解散 [12]
                    。此后，群雄纷纷割据一方，互相攻击。董卓迁都后，自封为太师，继续掌控朝政。
                    192年董卓最后被司徒王允和部下吕布等合谋刺杀，其族人亦被屠灭殆尽。不久董卓属下李傕、郭汜等人率兵攻入长安，杀死王允，吕布兵败逃亡，李傕等人挟持汉献帝，专政四年 [46]
                    。其间凉州马腾与韩遂等也率军逼近长安。李傕派郭汜、樊稠及侄子李利于长平观击败马腾等人。195年，由于李傕与郭汜等人内部不和，发生内斗，分别挟持献帝与大臣，长安陷入一片战乱 [42]
                    。7月，汉献帝离开长安，开始东归洛阳 [43] 。李傕与郭汜等人又联合起来，追击献帝。而后汉献帝派人与李傕、郭汜讲和才停止追击。196年献帝辗转流亡，回到已成废墟的旧都洛阳，随后被曹操迎奉到许都，
                    [12]
                    以汉献帝胁迫其他诸侯，史称“挟天子以令诸侯” [12] [47] 。隔年，郭汜被自己的部将伍习杀死。198年，曹操派裴茂率领段煨等关中诸将讨伐李傕，李傕被诛杀，至此关中初定。
                    群雄割据
                    官渡之战
                    官渡之战 [48]
                    讨伐董卓之战结束后，各地方军阀对东汉中央政权已不加理会，转而发展各自的势力。原董卓部下张济因军中缺粮，途径荆州南阳掠夺，在攻打穰城时战死。其军队由侄子张绣继承后 [49]
                    ，反被荆州牧刘表安置在宛城，联手抵御曹操。孙坚在攻打刘表据有的襄阳时战死 [45]
                    ，其子孙策投奔袁术后向他借兵，带领孙坚旧部于196年到199年间在江东四处征战。最后孙策独领江东，与刘表对峙，并等待时机北上中原。197年袁术于寿春称帝，国号“成” [50]
                    ，最后被曹操及刘备攻灭。194年益州牧刘焉病死，其子刘璋接任 [37]
                    ，与汉中的张鲁决裂，两方对峙。马腾、韩遂等人则于凉州、雍州一带各自发展势力。公孙瓒击败刘虞后雄踞幽州，最后被袁绍灭亡。东迁的吕布先是夺取曹操的兖州，被击败后先附刘备，接着夺其领地徐州，最后被曹操于下邳抓获处死。刘备继任病故的陶谦成为徐州牧，但先后因吕布及曹操而失去徐州，不得不依附河北袁绍，后又逃到汝南试图建立势力
                    [46] 。
                    此时期各势力中成绩最突出的是袁绍与曹操，袁绍先用计占据韩馥的冀州，继而打败田楷、臧洪、公孙瓒等人，掌握青、冀、幽、并四州，雄霸河北，气势强劲。曹操四处征战，收编黄巾军余部男女老少约十万人，择其精锐组成了著名的“青州军”
                    [12] ，几经转折，控制了兖州。曹操奉立东逃的献帝于许昌后，借由朝廷名义来讨伐各地群雄 [12]
                    ；先后破袁术、灭吕布、降张绣、逐刘备。势力发展成兖、豫、徐三州、部分司隶、雍州等中原地区。由于袁曹双方的势力持续壮大，最后发生了决战。公元200年曹操通过官渡之战大败袁绍，又通过几年时间，消灭了袁绍三个儿子袁谭、袁熙、袁尚的势力
                    [42] 。通过北征乌丸以及平定辽东公孙康，曹操基本上统一了北方。
                    三足鼎立
                    208年，曹操统一北方后，乘刘表病死之
                    赤壁之战
                    赤壁之战
                    机率大军南下，其子刘琮向曹操投降，刘备离开新野，南下江陵，途中被曹军追上击败，逃至夏口 [15]
                    。此时鲁肃到备处探听情况，刘备也派诸葛亮出使江东，双方结盟，共抗曹军。孙、刘联军以少胜多，大败曹军于赤壁，曹军退回北方后，平定马超、韩遂西北联军，统一北方。促使形成三国鼎立局面。孙权、刘备双方也开始各自争夺荆州。刘备成功逼降荆南四郡；而孙权部将周瑜也向荆州南郡发兵成功将西北一带收为领地
                    [51] 。211年，刘备率部进入益州，逐步占据了原来刘璋的地盘。219年，刘备从曹军手中夺得汉中，关羽也向曹军发起进攻，但是孙权遣吕蒙袭杀关羽 [15] [52]
                    ，占领荆州大部，隔三峡与汉军相持。222年，张飞被杀，刘备出兵与吴军相持于夷陵，猇亭一战，被吴将陆逊击败，退回益州，刘备不久便驾崩于白帝城 [15]
                    。之后不久，在诸葛亮、孙权的努力下蜀汉、东吴恢复结盟关系，共抗曹魏 [16] ，至此，三国鼎立局面正式形成。
                    夷陵之战
                    夷陵之战
                    南北之间虽然还常有战事发生，有时规模还比较大，但是总的说来，力量大体平衡，鼎足之势维持了四十余年之久。
                    263年，魏国丞相司马昭派钟会、邓艾、诸葛绪分兵三路南平蜀汉，与蜀汉大将军姜维发生拉锯战 [53] ，钟会被挡于剑阁前 [54]
                    ，邓艾避开姜维大军的锋芒，抄阴平小路直取涪城，进逼成都，蜀汉后主刘禅投降，蜀汉被魏所灭 [55] 。
                    三分归晋
                    晋武帝司马炎
                    晋武帝司马炎 [56]
                    265年司马昭去世，其子司马炎夺取曹魏政权，定都洛阳，建立晋朝，史称西晋 [57-58] 。司马炎称帝后开始筹备伐吴，派王濬于益州大造船舰，以羊祜镇守襄阳与镇守江陵的吴将陆抗对峙 [59-60]
                    。在264年孙皓即位后 [31]
                    ，交州（约今广西省及越南北部）向曹魏投降。两年后吴军意图夺回但被晋将毛炅击败。269年孙皓以虞汜、陶璜及李勖等人分陆海两路会师合浦，至271年方夺回交州。279年，修允部属郭马于广州（约今广东省及广西省）叛变，孙皓先后派滕循、陶浚、陶璜等多方围剿方平定。同年晋军率大军南征，吴国岌岌可危。
                    东吴重臣陆凯及陆抗相继去世后，晋将羊祜提议伐吴，但遭贾充反对而作罢 [61] [62]
                    。279年西北之乱始平，王濬、杜预上书司马炎，认为是时候伐吴，贾充、荀勖等认为西北未定而反对。最后司马炎决定于该年十一月大举进攻吴国，史称晋灭吴之战。他以贾充为大都督 [61] [62]
                    ，上游王濬唐彬军、中游杜预胡奋王戎军、下游王浑司马伷军多路并进。280年一月孙皓急任丞相张悌率沈莹、孙震渡江抵御王浑军，但皆战败而亡。而王濬军沿长江配合其他晋军攻下西陵、江陵、武昌及寻阳等地，杜预也夺下荆州南部。三月十五孙皓见晋军已包围建业，认为大势已去而投降。孙吴灭亡，西晋统一天下，至此三国时期结束。
                    疆域编辑
                    曹魏
                    三国地图
                    三国地图
                    曹魏的疆域在曹操时即大幅发展，曹丕称帝建国后定型，约占有整个华北地区。大致上北至山西、河北及辽东，与南匈奴、鲜卑及高句丽相邻 [63]
                    ；东至黄海。东南与孙吴对峙于长江淮河一带及汉江长江一带，以寿春、襄阳为重镇；西至甘肃， [2]
                    与河西鲜卑、羌及氐相邻。西南与蜀汉对峙于秦岭、河西一带，以长安为重镇。在立国后原有87郡及十二州，有：司隶、徐州、青州、豫州、冀州、并州、幽州、兖州、凉州、雍州、荆州、扬州。 [64]
                    曹魏于西域设置管辖海头的西域长史和管辖高昌的戊己校尉 [63]
                    。221年孙权称藩后，曹魏让孙权领有荆州牧，将荆扬等孙权势力则定为荆州，曹魏原直辖的荆州北部改称为郢州。双方决裂后曹魏复改郢州为荆州。220年至226年，分陇右置秦州，最后并入雍州。灭蜀汉后分益州置梁州，共增加两州。
                    [64-65]
                    蜀汉
                    蜀汉为刘备所建，他直到赤壁之战后才在诸葛亮协助下，由荆州南部开始发展。其势力一度涵盖荆州、益州及汉中。立国前后与孙吴发生多次战争并损失荆州，于诸葛亮南定南中后获得云南一带疆域 [16]
                    ，至此渐渐稳定。疆域范围：北方与曹魏对峙于秦岭，汉中为重镇；东与孙吴相邻于三峡，巴西为重镇；西南至岷江、南中，与羌、氐及南蛮相邻。蜀汉共有22郡、仅益州一州。于益州下设庲降都督，治味县，专辖益州南部。
                    [64]
                    东吴
                    东吴的疆域拥有大部分的扬州。孙权在赤壁之战后陆续获得荆州西部、交州，并在击败关羽后获得整个荆州南部。至孙权称帝后疆域方稳定下来。孙吴北与曹魏对峙在长江淮河一带及汉江长江一带，以建业、江陵为重镇；西与蜀汉相邻于三峡，西陵为重镇；东及南至东海南海，其中南达越南的中部。孙吴原有32郡及三州
                    [66] ：荆州、扬州、交州。于226年设置广州，后并入交州。至264年复设，共增加一州。 [64-65]
                    行政区划
                    魏蜀吴三国行政区
                    州名 范围
                    豫州
                    治所谯（qiáo，安徽亳州），所辖今豫南部、东部、皖北部、苏西北角及山东西南角
                    兖州
                    治所昌邑（今鲁金乡县西北），所辖今山东西南部，豫东部和苏西北角
                    徐州
                    治所郯（tán，郯城县西南，后迁下邳），所辖今鲁东南部，江苏北部及皖东北角
                    凉州
                    治所陇（甘肃清水县北），所辖今甘东东部
                    雍州
                    原为光武帝刘秀所置，后取消。公元194年，李傕把凉州分为凉州和雍州。公元213年，曹操将司州三分一，司州之一便分到雍州
                    冀州
                    治所鄗（hào）（河北柏乡县北，后迁邺城），所辖今冀西南部，后被曹操以冀、青、并、幽四州合为冀州
                    扬州
                    治所历阳（皖和县，后迁寿春），所辖今苏南部、皖中南部，浙、闽、赣三省
                    荆州
                    治所汉寿（湘常德市东，后迁襄阳），所辖今豫西南部，鄂、湘二省及黔、桂、粤三省边缘
                    益州
                    治所雒（luò，川广汉市，后绵竹，再成都），所辖今川、黔、滇三省大部，陕及鄂、甘各一隅
                    交州
                    包括今天越南北、中部和中国广西的一部分。东汉交州治番禺，即今广州，辖今两广及越南北部。吴分交州为交州和广州，广州治番禺，交州治龙编（在今越南河内东），交州辖今越南北部和两广的雷州半岛和钦州地区。
                </p>
            </div>
            <hr>
            <div class="discuss-box">
                <h2>评论区</h2>
                <div class="discusses">
                    <div class="discuss-title">
                        <h4>张三</h4>
                        <div>发表时间: 2019-12-22</div>
                    </div>
                    <hr>
                    <div>这篇文章真的很不错</div>
                </div>
                <div>点击显示更多</div>
            </div>
        </div>
        <div class="other">
            <div class="author-box">
                <h2>作者信息</h2>
                <h3>
                    昵称: TPQ
                </h3>
                <h3>
                    性别: 女
                </h3>
                <h3>
                    年龄: 18
                </h3>
                <h3>
                    爱好: xxx
                </h3>
                <h3>
                    简介: 我是一个很有礼貌的人啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
                </h3>
            </div>
        </div>
    </section>

</mian>
<%@include file="/WEB-INF/public/footer.jsp" %>
</body>
</html>
